## `terraform/scheduling`
#### Terraform Format and Style 🖌`'Changes needed.'`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=7844220088678366186]
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_security_group.fargate_sg: Reading...
data.aws_vpc.myvpc: Reading...
data.aws_sns_topic.my_sns: Reading...
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
data.aws_iam_role.task_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_iam_role.task_execution_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 1s [id=528163014577]
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
data.aws_iam_role.task_role: Read complete after 1s [id=ecs_tasks-minecraft-test-role]
data.aws_iam_role.task_execution_role: Read complete after 1s [id=minecraft-test-ecs_tasks_execution-role]
data.aws_sns_topic.my_sns: Read complete after 1s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 1s [id=Z006257634KDWA8TCRYLE]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1875139620]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function-logs]
data.aws_security_group.fargate_sg: Read complete after 1s [id=sg-07934f64784cd1b97]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20240623023733684900000002]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=user-action-filter-function-20240623023733697000000003]
module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0]: Refreshing state... [id=user-action-filter-function]
data.aws_vpc.myvpc: Read complete after 2s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240623023731888800000001/0420b3644266b7ca]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/c90ec2be010f09c3]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_lambda_permission.log_permission: Refreshing state... [id=terraform-20240623024320306000000001]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"]: Refreshing state... [id=cwlsf-384885153]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=562731569554702347]
module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/c90ec2be010f09c3/b6c2fcaf71a4ecc3]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_minecraft.smat710.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "user-action-filter-function"
      ~ last_modified                  = "2024-06-23T02:43:14.701+0000" -> "2024-06-23T02:43:20.453+0000"
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "user-action-filter-function"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:62" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:62/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "62" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WEB_HOOK_URL"  = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>